var status = 0;
var choice;
var scrolls = Array(Array('星火双手武器攻击力卷轴', 2612010, 10000), Array('星火单手武器魔法力卷轴', 2613001, 10000), Array('星火单手武器攻击力卷轴', 2613000, 10000), Array('X单手武器魔力卷轴', 2613051, 10000), Array('X单手武器攻击力卷轴', 2613050, 10000), Array('X双手武器魔力卷轴', 2612062, 10000), Array('X双手武器攻击力卷轴', 2612061, 10000), Array('X防具魔力卷轴', 2616062, 10000), Array('X防具攻击力卷轴', 2616061, 10000), Array('X饰品攻击力卷轴', 2615031, 10000), Array('X饰品魔力卷轴', 2615032, 10000), Array('专属饰品攻击力卷轴', 5530457, 10000), Array('专属饰品魔力卷轴', 5530458, 10000), Array('专属饰品魔力卷轴', 2047403, 10000), Array('专属饰品攻击力卷轴', 2047402, 10000), Array('专属饰品魔力卷轴', 2046857, 10000), Array('专属饰品攻击力卷轴', 2046856, 10000), Array('究极黑暗防具魔力卷轴', 2616215, 10000), Array('究极黑暗防具攻击力卷轴', 2616214, 10000), Array('究极黑暗宠物装备魔力卷轴', 2048824, 10000), Array('究极黑暗宠物装备攻击力卷轴', 2048823, 10000), Array('究极黑暗双手武器魔力卷轴', 2612079, 10000), Array('究极黑暗双手武器攻击力卷轴', 2612078, 10000), Array('究极黑暗单手武器魔力卷轴', 2613067, 10000), Array('究极黑暗单手武器攻击力卷轴', 2613066, 10000), Array('究极黑暗饰品魔力卷轴', 2615050, 10000), Array('究极黑暗饰品攻击力卷轴', 2615049, 10000), Array('V单手武器魔力卷轴', 2613065, 10000), Array('V单手武器攻击力卷轴', 2613064, 10000), Array('V双手武器魔力卷轴', 2612077, 10000), Array('V双手武器攻击力卷轴', 2612076, 10000), Array('V饰品攻击力卷轴', 2615043, 10000), Array('饰品攻击力卷轴', 2046817, 10000), Array('饰品攻击力卷轴', 2046819, 10000), Array('饰品攻击力卷轴', 2046829, 10000), Array('饰品攻击力卷轴', 2046839, 10000), Array('纯白卷轴100%', 2049032, 10000), Array('混沌卷轴100%', 2049175, 10000), Array('星之力20星强化券', 2049389, 10000), Array('星之力19星强化券', 2049388, 10000), Array('星之力18星强化券', 2049387, 10000), Array('星之力17星强化券', 2049386, 10000), Array('星之力16星强化券', 2049385, 10000), Array('星之力15星强化券', 2049384, 10000), Array('星之力14星强化券', 2049383, 10000), Array('星之力13星强化券', 2049382, 10000), Array('星之力12星强化券', 2049381, 10000), Array('星之力11星强化券', 2049380, 10000), Array('星之力10星强化卷轴', 2049344, 10000), Array('涅槃火焰150级', 2048731, 10000), Array('涅槃火焰140级', 2048730, 10000), Array('涅槃火焰130级', 2048729, 10000), Array('涅槃火焰120级', 2048728, 10000), Array('涅槃火焰110级', 2048727, 10000), Array('涅槃火焰160级', 2048725, 10000), Array('强大的涅槃火焰', 2048724, 10000), Array('永远的涅槃火焰', 2048723, 10000), Array('炽热的涅磐火焰', 2048722, 10000), Array('永远的涅槃火焰', 2048721, 10000));
function start() {
    status = -1;
    action(1, 0, 0);
}
function action(f, d, c) {
    if (f == -1) {
        cm.dispose();
    } else {
        if (status == 0 && f == 0) {
            cm.dispose();
            return;
        } else {
            if (status >= 1 && f == 0) {
                cm.sendOk('好吧，欢迎下次继续光临！.');
                cm.dispose();
                return;
            }
        }
        if (f == 1) {
            status++;
        } else {
            status--;
        }
        if (status == 0) {
            choices = '\r\n点卷：#r' + cm.getPlayer().getCSPoints(1) + '#k (#r买后不支持退货哟亲#k)';
            for (var a = 0; a < scrolls.length; a++) {
                choices += '\r\n#L' + a + '##v' + scrolls[a][1] + '##z' + scrolls[a][1] + '#　#d需要#r' + scrolls[a][2] + '#d点卷#k#l';
            }
            cm.askMenuS('欢迎来到' + cm.getServerName() + '卷轴店,你想买我们商店的物品么?请选择吧：.' + choices);
        } else {
            if (status == 1) {
                cm.askYesNo('你确定要购买#v' + scrolls[c][1] + '##t' + scrolls[c][1] + '#?');
                choice = c;
            } else {
                if (status == 2) {
                    var b = scrolls[choice][2];
                    if (cm.getPlayer().getCSPoints(1) < b) {
                        cm.sendOk('抱歉，你没足够的点卷！');
                        cm.dispose();
                    } else {
                        var e = cm.gainGachaponItem(scrolls[choice][1], 1, '卷轴店', 3, true);
                        if (e != -1) {
                            cm.getPlayer().modifyCSPoints(1, -b);
                            cm.dispose();
                            cm.sendOk('恭喜您成功购买#i' + scrolls[choice][1] + ':# #b#t' + scrolls[choice][1] + '##k。');
                        } else {
                            cm.sendOk('购买失败，请您确认在背包所有栏目窗口中是否有一格以上的空间。');
                        }
                    }
                }
            }
        }
    }
}