var choice;
var status = -1;
var selectionLog = [];
var scrolls = Array(Array('最高级贝勒德耳环', 1032223, 10000), Array('最高级贝勒德戒指', 1113075, 10000), Array('最高级贝勒德刻印腰带', 1132246, 10000), Array('最高级贝勒德刻印吊坠', 1122267, 10000), Array('暴君利卡昂腰带', 1132177, 10000), Array('暴君利卡昂手套', 1082546, 10000), Array('暴君利卡昂披风', 1102484, 10000), Array('暴君利卡昂靴', 1072746, 10000), Array('暴君西亚戴斯披风', 1102481, 10000), Array('暴君西亚戴斯靴', 1072743, 10000), Array('暴君西亚戴斯手套', 1082543, 10000), Array('暴君西亚戴斯腰带', 1132174, 10000), Array('暴君凯伦手套', 1082545, 10000), Array('暴君凯伦腰带', 1132176, 10000), Array('暴君凯伦披风', 1102483, 10000), Array('暴君凯伦靴', 1072745, 10000), Array('暴君赫尔梅斯手套', 1082544, 10000), Array('暴君赫尔梅斯披风', 1102482, 10000), Array('暴君赫尔梅斯靴', 1072744, 10000), Array('暴君赫尔梅斯腰带', 1132175, 10000), Array('暴君阿尔泰手套', 1082547, 10000), Array('暴君阿尔泰腰带', 1132178, 10000), Array('暴君阿尔泰披风', 1102485, 10000), Array('暴君阿尔泰靴', 1072747, 10000), Array('不灭之手链', 1354007, 10000), Array('银河之扳指', 1352276, 10000), Array('银河之鹰眼', 1352916, 10000), Array('银河之魂珠', 1352406, 10000), Array('银河之花扇', 1552084, 10000), Array('银河之狐狸珠', 1353105, 10000), Array('银河之剑鞘', 1352286, 10000), Array('银河之灵魂手镯', 1352606, 10000), Array('银河之念珠', 1352216, 10000), Array('银河之精气球', 1353606, 10000), Array('银河之狂野之矛', 1352967, 10000), Array('银河之咒盾', 1099011, 10000), Array('银河之白金之书', 1352256, 10000), Array('银河之盾', 1099012, 10000), Array('银河之麦林弹', 1352707, 10000), Array('银河之吊坠', 1352206, 10000), Array('银河之刃', 1342095, 10000), Array('银河之圣地之光', 1352975, 10000), Array('银河之箭矢', 1352009, 10000), Array('银河之风暴羽毛', 1352266, 10000), Array('银河之腕轮', 1352906, 10000), Array('银河之青银之书', 1352246, 10000), Array('银河之龙神的遗产', 1352945, 10000), Array('银河之极限球', 1352957, 10000), Array('银河之爆破弹', 1353405, 10000), Array('银河之宿命之拳', 1352824, 10000), Array('银河之精髓', 1352506, 10000), Array('银河之小太刀', 1352807, 10000), Array('银河之天龙锤', 1352935, 10000), Array('银河之火药桶', 1352928, 10000), Array('银河之不灭之翼', 1353505, 10000), Array('银河之锁链', 1352226, 10000), Array('银河之赤铜之书', 1352236, 10000), Array('银河之卡片', 1352109, 10000), Array('银河之控制器', 1353006, 10000), Array('银河之私语', 1352815, 10000), Array('银河之灵符', 1352296, 10000), Array(' 1', 1182285, 10000), Array(' 1', 1213021, 10000), Array(' 1', 1442285, 10000), Array(' 1', 1242141, 10000), Array(' 1', 1242139, 10000), Array(' 1', 1232122, 10000), Array(' 1', 1272040, 10000), Array(' 1', 1382274, 10000), Array(' 1', 1362149, 10000), Array(' 1', 1252106, 10000), Array(' 1', 1282040, 10000), Array(' 1', 1302355, 10000), Array(' 1', 1492245, 10000), Array(' 1', 1582044, 10000), Array(' 1', 1452266, 10000), Array(' 1', 1552130, 10000), Array(' 1', 1222122, 10000), Array(' 1', 1212129, 10000), Array(' 1', 1322264, 10000), Array(' 1', 1402268, 10000), Array(' 1', 1412189, 10000), Array(' 1', 1532157, 10000), Array(' 1', 1312213, 10000), Array(' 1', 1262051, 10000), Array(' 1', 1482232, 10000), Array(' 1', 1522152, 10000), Array(' 1', 1422196, 10000), Array(' 1', 1422197, 10000), Array(' 1', 1542128, 10000), Array(' 1', 1372237, 10000), Array(' 1', 1432227, 10000), Array(' 1', 1462252, 10000), Array(' 1', 1472275, 10000), Array(' 1', 1332289, 10000), Array(' 1', 1213018, 10000), Array(' 1', 1442274, 10000), Array(' 2', 1332279, 10000), Array(' 2', 1342104, 10000), Array(' 2', 1232113, 10000), Array(' 2', 1362140, 10000), Array(' 2', 1242122, 10000), Array(' 2', 1242121, 10000), Array(' 2', 1302343, 10000), Array(' 2', 1582023, 10000), Array(' 2', 1582023, 10000), Array(' 2', 1252098, 10000), Array(' 2', 1492235, 10000), Array(' 2', 1272017, 10000), Array(' 2', 1552119, 10000), Array(' 2', 1402259, 10000), Array(' 2', 1412181, 10000), Array(' 2', 1452257, 10000), Array(' 2', 1312203, 10000), Array(' 2', 1432218, 10000), Array(' 2', 1222113, 10000), Array(' 2', 1322255, 10000), Array(' 2', 1522143, 10000), Array(' 2', 1532150, 10000), Array(' 2', 1382265, 10000), Array(' 2', 1262039, 10000), Array(' 2', 1422189, 10000), Array(' 2', 1462243, 10000), Array(' 2', 1482221, 10000), Array(' 2', 1372228, 10000), Array(' 2', 1542117, 10000), Array(' 2', 1212120, 10000), Array(' 2', 1472265, 10000), Array(' 2', 1592020, 10000), Array('神秘之影战士护肩', 1152196, 10000), Array('神秘之影战士鞋', 1073158, 10000), Array('神秘之影战士套装', 1053063, 10000), Array('神秘之影战士手套', 1082695, 10000), Array('神秘之影战士帽', 1004808, 10000), Array('神秘之影战士披风', 1102940, 10000), Array('神秘之影法师护肩', 1152197, 10000), Array('神秘之影法师帽', 1004809, 10000), Array('神秘之影法师鞋', 1073159, 10000), Array('神秘之影法师套装', 1053064, 10000), Array('神秘之影法师手套', 1082696, 10000), Array('神秘之影法师披风', 1102941, 10000), Array('神秘之影弓箭手帽', 1004810, 10000), Array('神秘之影弓箭手护肩', 1152198, 10000), Array('神秘之影弓箭手鞋', 1073160, 10000), Array('神秘之影弓箭手套装', 1053065, 10000), Array('神秘之影弓箭手手套', 1082697, 10000), Array('神秘之影弓箭手披风', 1102942, 10000), Array('神秘之影飞侠帽', 1004811, 10000), Array('神秘之影飞侠护肩', 1152199, 10000), Array('神秘之影飞侠鞋', 1073161, 10000), Array('神秘之影飞侠套装', 1053066, 10000), Array('神秘之影飞侠手套', 1082698, 10000), Array('神秘之影飞侠披风', 1102943, 10000), Array('神秘之影海盗披风', 1102944, 10000), Array('神秘之影海盗帽', 1004812, 10000), Array('神秘之影海盗护肩', 1152200, 10000), Array('神秘之影海盗鞋', 1073162, 10000), Array('神秘之影海盗套装', 1053067, 10000), Array('神秘之影海盗手套', 1082699, 10000), Array('未来机器人心脏 : 最高级', 1672039, 2000), Array('万圣节机器人', 1662041, 3000), Array('奥尔卡机器人', 1662039, 3000), Array('神之子贝塔机器人', 1662036, 3000), Array('银河战士', 1662027, 3000), Array('女妖机器人', 1662032, 3000), Array('神之子阿尔法机器人', 1662035, 2000), Array('未来机器人(男)', 1662033, 4000), Array('未来机器人(女)', 1662034, 4000));
function start() {
    action(1, 0, 0);
}
function action(d, g, j) {
    var h = cm.getConstantScriptContent('菜单_NPC立绘');
    var e = Math.floor(Math.random() * h.length);
    var b = h[e][0];
    var f = randomNum(0, h[e][1]);
    if (status == 0 && d == 0) {
        cm.dispose();
    }
    d == 1 ? status++ : status--;
    selectionLog[status] = j;
    var c = -1;
    if (status <= c++) {
        cm.dispose();
    } else {
        if (status === c++) {
            choices = '' + cm.getServerName() + '单机版 装备自选商店：#k';
            for (var c = 0; c < scrolls.length; c++) {
                if (c == 24 || c == 60 || c == 93 || c == 124 || c == 157) {
                    choices += '\r\n';
                }
                choices += '\r\n #b#L' + c + '##v' + scrolls[c][1] + '##z' + scrolls[c][1] + '#  #r' + scrolls[c][2] + '#b点券#k#l';
            }
            cm.sendNext(choices);
        } else {
            if (status === c++) {
                cm.askYesNo_Bottom('#face' + f + '#你确定要购买 #b#v' + scrolls[j][1] + '##z' + scrolls[j][1] + '##k 吗?', b);
                choice = j;
            } else {
                if (status === c++) {
                    var a = scrolls[choice][2];
                    if (cm.getPlayer().getCSPoints(1) < a) {
                        cm.sendOk('抱歉，你没足够的点卷！');
                        cm.dispose();
                    } else {
                        cm.gainItem(scrolls[choice][1], 1);
                        cm.getPlayer().modifyCSPoints(1, -a);
                        cm.dispose();
                        cm.sendNext_Bottom('#face' + f + '#恭喜您成功购买#v' + scrolls[choice][1] + '# #b#t' + scrolls[choice][1] + '##k。', b);
                    }
                }
            }
        }
    }
}
function randomNum(b, a) {
    switch (arguments.length) {
    case 1:
        return parseInt(Math.random() * b + 1, 10);
        break;
    case 2:
        return parseInt(Math.random() * (a - b + 1) + b, 10);
        break;
    default:
        return 0;
        break;
    }
}