var text;
var selects;
var buynum = 0;
var status = -1;
var selectionLog = [];
var itemlist = Array(Array('金锤子', 5570000, 10000), Array('红色蜡笔', 3994417, 10000), Array('橙色蜡笔', 3994418, 10000), Array('黄色蜡笔', 3994419, 10000), Array('绿色蜡笔', 3994420, 10000), Array('青色蜡笔', 3994421, 10000), Array('蓝色蜡笔', 3994422, 10000), Array('500万极限突破石100%', 2614064, 10000), Array('1000万极限突破石100%', 2614067, 10000), Array('3000万极限突破石100%', 2614068, 10000), Array('5000万极限突破石100%', 2614069, 10000), Array('1亿极限突破石100%', 2614074, 10000), Array('5亿极限突破石100%', 2614077, 10000), Array('皇家理发券', 5150040, 980), Array('顶级皇家理发券', 5150064, 980), Array('经典皇家理发券', 5150100, 980), Array('RED皇家理发券', 5150119, 980), Array('周年庆皇家理发券', 5150126, 980), Array('毛莫理发券%', 5150123, 980), Array('九尾狐理发券', 5150124, 980), Array('闪耀之星皇家理发券', 5150135, 980), Array('奇迹皇家理发券', 5150139, 980), Array('高科技电光镖', 2070019, 10000), Array('水晶飞镖', 2070016, 10000), Array('火焰飞镖', 2070023, 10000), Array('白金飞镖', 2070026, 10000), Array('枫叶镖', 2070011, 10000), Array('月牙镖', 2070007, 10000), Array('齿轮镖', 2070006, 10000), Array('雪花镖', 2070003, 10000), Array('金钱镖', 2070005, 10000), Array('无限飞镖', 2070024, 10000), Array('高科技穿甲弹', 2330007, 10000), Array('穿甲弹', 2330005, 10000), Array('钻石弩矢', 2061004, 10000), Array('钻石箭矢', 2060004, 10000), Array('钢铁弩矢', 2061002, 10000), Array('钢铁弓矢', 2060002, 10000), Array('星火双手武器攻击力卷轴', 2612010, 10000), Array('星火单手武器魔法力卷轴', 2613001, 10000), Array('星火单手武器攻击力卷轴', 2613000, 10000), Array('X单手武器魔力卷轴', 2613051, 10000), Array('X单手武器攻击力卷轴', 2613050, 10000), Array('X双手武器魔力卷轴', 2612062, 10000), Array('X双手武器攻击力卷轴', 2612061, 10000), Array('X防具魔力卷轴', 2616062, 10000), Array('X防具攻击力卷轴', 2616061, 10000), Array('X饰品攻击力卷轴', 2615031, 10000), Array('X饰品魔力卷轴', 2615032, 10000), Array('专属饰品攻击力卷轴', 5530457, 10000), Array('专属饰品魔力卷轴', 5530458, 10000), Array('专属饰品魔力卷轴', 2047403, 10000), Array('专属饰品攻击力卷轴', 2047402, 10000), Array('专属饰品魔力卷轴', 2046857, 10000), Array('专属饰品攻击力卷轴', 2046856, 10000), Array('究极黑暗防具魔力卷轴', 2616215, 10000), Array('究极黑暗防具攻击力卷轴', 2616214, 10000), Array('究极黑暗宠物装备魔力卷轴', 2048824, 10000), Array('究极黑暗宠物装备攻击力卷轴', 2048823, 10000), Array('究极黑暗双手武器魔力卷轴', 2612079, 10000), Array('究极黑暗双手武器攻击力卷轴', 2612078, 10000), Array('究极黑暗单手武器魔力卷轴', 2613067, 10000), Array('究极黑暗单手武器攻击力卷轴', 2613066, 10000), Array('究极黑暗饰品魔力卷轴', 2615050, 10000), Array('究极黑暗饰品攻击力卷轴', 2615049, 10000), Array('V单手武器魔力卷轴', 2613065, 10000), Array('V单手武器攻击力卷轴', 2613064, 10000), Array('V双手武器魔力卷轴', 2612077, 10000), Array('V双手武器攻击力卷轴', 2612076, 10000), Array('V饰品攻击力卷轴', 2615043, 10000), Array('饰品攻击力卷轴', 2046817, 10000), Array('饰品攻击力卷轴', 2046819, 10000), Array('饰品攻击力卷轴', 2046829, 10000), Array('饰品攻击力卷轴', 2046839, 10000), Array('纯白卷轴100%', 2049032, 10000), Array('混沌卷轴100%', 2049175, 10000), Array('星之力20星强化券', 2049389, 10000), Array('星之力19星强化券', 2049388, 10000), Array('星之力18星强化券', 2049387, 10000), Array('星之力17星强化券', 2049386, 10000), Array('星之力16星强化券', 2049385, 10000), Array('星之力15星强化券', 2049384, 10000), Array('星之力14星强化券', 2049383, 10000), Array('星之力13星强化券', 2049382, 10000), Array('星之力12星强化券', 2049381, 10000), Array('星之力11星强化券', 2049380, 10000), Array('星之力10星强化卷轴', 2049344, 10000), Array('涅槃火焰150级', 2048731, 10000), Array('涅槃火焰140级', 2048730, 10000), Array('涅槃火焰130级', 2048729, 10000), Array('涅槃火焰120级', 2048728, 10000), Array('涅槃火焰110级', 2048727, 10000), Array('涅槃火焰160级', 2048725, 10000), Array('强大的涅槃火焰', 2048724, 10000), Array('永远的涅槃火焰', 2048723, 10000), Array('炽热的涅磐火焰', 2048722, 10000), Array('永远的涅槃火焰', 2048721, 10000));
function start() {
    action(1, 0, 0);
}
function action(h, f, e) {
    var c = cm.getConstantScriptContent('菜单_NPC立绘');
    var b = Math.floor(Math.random() * c.length);
    var a = c[b][0];
    var g = randomNum(0, c[b][1]);
    if (status == 0 && h == 0) {
        cm.dispose();
    }
    h == 1 ? status++ : status--;
    selectionLog[status] = e;
    var d = -1;
    if (status <= d++) {
        cm.dispose();
    } else {
        if (status === d++) {
            text = '' + cm.getServerName() + '单机版 道具自选商店：';
            for (var d = 0; d < itemlist.length; d++) {
                text += '\r\n #b#L' + d + '##v' + itemlist[d][1] + '##z' + itemlist[d][1] + '#  #r' + itemlist[d][2] + '#b点券#k#l';
            }
            cm.sendNext(text);
        } else {
            if (status === d++) {
                cm.askNumber('#face' + g + '#你确定要购买 #b#v' + itemlist[e][1] + '##z' + itemlist[e][1] + '##k 吗?', 0, 0, 999999);
                selects = e;
            } else {
                if (status === d++) {
                    buynum = e;
                    if (cm.getPlayer().getCSPoints(1) >= buynum * itemlist[selects][2]) {
                        cm.getPlayer().modifyCSPoints(1, -buynum * itemlist[selects][2]);
                        cm.gainItem(itemlist[selects][1], buynum);
                        cm.dispose();
                        cm.sendNext_Bottom('#face' + g + '#恭喜您成功购买#v' + itemlist[selects][1] + '# #b#t' + itemlist[selects][1] + '##k。', a);
                    } else {
                        cm.sendOk('对不起，你没有足够的点卷。');
                        cm.dispose();
                    }
                }
            }
        }
    }
}
function randomNum(b, a) {
    switch (arguments.length) {
    case 1:
        return parseInt(Math.random() * b + 1, 10);
        break;
    case 2:
        return parseInt(Math.random() * (a - b + 1) + b, 10);
        break;
    default:
        return 0;
        break;
    }
}