var a = 0;
var text;
var selects;
var buynum = 0;
var itemlist = Array(Array('月光星空云朵骑宠', 80001994, 10000), Array('轰隆隆品克缤骑宠', 80001995, 10000), Array('轰隆隆品克缤骑宠', 80001996, 10000), Array('闪闪心骑宠', 80001997, 10000), Array('闪闪心骑宠', 80001998, 10000), Array('与卡奥一起共乘的纸船骑宠', 80002200, 10000), Array('纸船骑宠', 80002201, 10000), Array('火焰鸟骑宠', 80002202, 10000), Array('null', 80002203, 10000), Array('飞鱼骑宠', 80002204, 10000), Array('小霓虹之翼骑宠', 80002205, 10000), Array('云飘飘骑宠', 80002219, 10000), Array('那是什么鬼骑宠', 80002220, 10000), Array('气球飘飘骑宠', 80002221, 10000), Array('旋翼机骑宠', 80002222, 10000), Array('粉色啾啾鲸骑宠', 80002223, 10000), Array('粉色啾啾鲸骑宠', 80002224, 10000), Array('蓝色啾啾鲸骑宠', 80002225, 10000), Array('蓝色啾啾鲸骑宠', 80002226, 10000), Array('火焰鸟骑宠', 80002227, 10000), Array('飞鱼骑宠', 80002228, 10000), Array('沙锥宝宝骑宠', 80002229, 10000), Array('月妙公子骑宠', 80002233, 10000), Array('七彩盾牌风筝骑宠', 80002234, 10000), Array('纷飞吧韩字骑宠', 80002235, 10000), Array('彩色自行车骑宠', 80002236, 10000), Array('彩色自行车骑宠', 80002237, 10000), Array('弹跳小鹿骑宠', 80002238, 10000), Array('弹跳小鹿骑宠', 80002239, 10000), Array('甜美甜甜圈骑宠', 80002240, 10000), Array('甜美甜甜圈骑宠', 80002241, 10000), Array('购物车骑宠', 80002242, 10000), Array('购物车骑宠', 80002243, 10000), Array('小黑天使之翼骑宠', 80002244, 10000), Array('冰心骑宠', 80002248, 10000), Array('冰心骑宠', 80002249, 10000), Array('快步小浣熊骑宠', 80002250, 10000), Array('快步小浣熊骑宠', 80002251, 10000), Array('冰夜骑行', 80002252, 10000), Array('冰夜骑行', 80002253, 10000), Array('星空热气球骑宠', 80002257, 10000), Array('橄榄球兔骑宠', 80002258, 10000), Array('喜鹊骑宠', 80002259, 10000), Array('喵喵喵抱枕骑宠', 80002260, 10000), Array('喵喵喵抱枕骑宠', 80002261, 10000), Array('蓝色', 80002262, 10000), Array('蓝色烈焰哈士奇骑宠', 80002263, 10000), Array('喜鹊篮骑宠', 80002265, 10000), Array('联盟排名骑宠', 80002266, 10000), Array('天空自行车骑宠', 80002270, 10000), Array('北极熊骑宠', 80002271, 10000), Array('阿尔卡那风精灵骑宠', 80002272, 10000), Array('松鼠滑板车骑宠', 80002276, 10000), Array('null', 80002277, 10000), Array('月亮香蕉骑宠', 80002278, 10000), Array('月亮香蕉骑宠', 80002279, 10000), Array('null', 80002287, 10000), Array('null', 80002288, 10000), Array('null', 80002289, 10000), Array('null', 80002290, 10000), Array('null', 80002294, 10000), Array('null', 80002295, 10000), Array('null', 80002296, 10000), Array('null', 80002297, 10000), Array('null', 80002299, 10000), Array('null', 80002302, 10000), Array('null', 80002304, 10000), Array('null', 80002305, 10000), Array('null', 80002306, 10000), Array('null', 80002307, 10000), Array('null', 80002308, 10000), Array('null', 80002309, 10000), Array('null', 80002313, 10000), Array('null', 80002314, 10000), Array('null', 80002315, 10000), Array('null', 80002316, 10000), Array('null', 80002317, 10000), Array('null', 80002318, 10000), Array('null', 80002319, 10000), Array('null', 80002320, 10000), Array('null', 80002321, 10000), Array('null', 80002322, 10000), Array('null', 80002335, 10000), Array('null', 80002345, 10000), Array('null', 80002346, 10000), Array('null', 80002347, 10000), Array('null', 80002348, 10000), Array('null', 80002349, 10000), Array('null', 80002350, 10000), Array('null', 80002351, 10000), Array('null', 80002352, 10000), Array('null', 80002353, 10000), Array('null', 80002354, 10000), Array('null', 80002355, 10000), Array('null', 80002356, 10000), Array('null', 80002357, 10000), Array('null', 80002358, 10000), Array('null', 80002359, 10000), Array('null', 80002361, 10000), Array('null', 80002366, 10000), Array('null', 80002367, 10000), Array('null', 80002368, 10000), Array('null', 80002369, 10000), Array('null', 80002370, 10000), Array('null', 80002372, 10000), Array('null', 80002373, 10000), Array('null', 80002374, 10000), Array('null', 80002375, 10000), Array('null', 80002382, 10000), Array('null', 80002383, 10000), Array('null', 80002384, 10000), Array('null', 80002385, 10000), Array('null', 80002392, 10000), Array('null', 80002400, 10000), Array('null', 80002401, 10000), Array('null', 80002402, 10000), Array('null', 80002403, 10000), Array('null', 80002417, 10000), Array('null', 80002418, 10000), Array('null', 80002424, 10000), Array('null', 80002425, 10000), Array('null', 80002426, 10000), Array('null', 80002427, 10000), Array('null', 80002429, 10000), Array('null', 80002430, 10000), Array('null', 80002431, 10000), Array('null', 80002432, 10000), Array('null', 80002433, 10000), Array('null', 80002434, 10000), Array('null', 80002435, 10000), Array('null', 80002436, 10000), Array('null', 80002437, 10000), Array('null', 80002438, 10000), Array('null', 80002439, 10000), Array('null', 80002440, 10000), Array('null', 80002441, 10000), Array('null', 80002442, 10000), Array('null', 80002443, 10000), Array('null', 80002446, 10000), Array('null', 80002447, 10000), Array('null', 80002448, 10000), Array('null', 80002449, 10000), Array('null', 80002450, 10000), Array('null', 80002451, 10000), Array('null', 80002454, 10000), Array('null', 80002455, 10000), Array('null', 80002456, 10000), Array('null', 80002457, 10000), Array('null', 80002545, 10000), Array('null', 80002546, 10000), Array('null', 80002547, 10000), Array('null', 80002557, 10000), Array('null', 80002563, 10000), Array('null', 80002564, 10000), Array('null', 80002565, 10000), Array('null', 80002566, 10000), Array('null', 80002569, 10000), Array('null', 80002570, 10000), Array('null', 80002571, 10000), Array('null', 80002572, 10000), Array('null', 80002573, 10000), Array('null', 80002574, 10000), Array('null', 80002585, 10000), Array('null', 80002591, 10000), Array('null', 80002594, 10000), Array('null', 80002595, 10000), Array('null', 80002622, 10000), Array('null', 80002624, 10000), Array('null', 80002626, 10000), Array('null', 80002627, 10000), Array('null', 80002628, 10000), Array('null', 80002629, 10000), Array('null', 80002630, 10000), Array('null', 80002631, 10000), Array('null', 80002648, 10000), Array('null', 80002649, 10000), Array('null', 80002650, 10000), Array('null', 80002651, 10000), Array('null', 80002654, 10000), Array('null', 80002667, 10000), Array('null', 80002655, 10000), Array('null', 80002656, 10000), Array('null', 80002659, 10000), Array('null', 80002660, 10000), Array('null', 80002663, 10000), Array('null', 80002664, 10000), Array('null', 80002665, 10000), Array('null', 80002666, 10000), Array('null', 80002668, 10000), Array('null', 80002669, 10000), Array('null', 80002698, 10000), Array('null', 80002699, 10000), Array('null', 80002702, 10000), Array('null', 80002712, 10000), Array('null', 80002713, 10000), Array('和品克缤一起旅行骑宠', 80011000, 10000), Array('蓝色梦魇', 80011025, 10000), Array('小行星骑宠', 80011026, 10000), Array('LV骑宠', 80011027, 10000), Array('舞狮', 80011028, 10000), Array('赤兔马', 80011029, 10000), Array('幽灵马车骑宠', 80011030, 10000), Array('可爱猫咪人力车骑宠', 80011093, 10000), Array('摩托艇骑宠', 80011094, 10000), Array('摩托艇骑宠', 80011095, 10000), Array('蜜蝴蝶骑宠', 80011109, 10000), Array('迷你太空船', 80011110, 10000), Array('喷气式滑艇载具', 80011127, 10000), Array('潜水艇载具', 80011128, 10000), Array('直升机载具', 80011129, 10000), Array('热气球载具', 80011134, 10000), Array('独木舟载具', 80011135, 10000), Array('改造直升机载具', 80011136, 10000), Array('猫咪海盗船', 80011137, 10000), Array('驯鹿雪橇骑宠', 80011138, 10000), Array('蛋糕骑宠', 80011139, 10000), Array('驯鹿雪橇骑宠', 80011140, 10000), Array('蛋糕骑宠', 80011142, 10000), Array('美羊羊骑宠', 80011147, 10000), Array('喜羊羊骑宠', 80011148, 10000), Array('礼物雪球骑宠', 80011156, 10000), Array('迷你黑色天堂', 80011157, 10000), Array('美羊羊骑宠', 80011160, 10000), Array('喜羊羊骑宠', 80011161, 10000), Array('雪花骑宠', 80011175, 10000), Array('拯救骑宠', 80011179, 10000), Array('喷气式滑艇载具', 80011180, 10000), Array('潜水艇载具', 80011181, 10000), Array('直升机载具', 80011182, 10000), Array('热气球载具', 80011183, 10000), Array('独木舟载具', 80011184, 10000), Array('改造直升机载具', 80011185, 10000), Array('猫咪海盗船', 80011186, 10000), Array('王权马车骑宠', 80011189, 10000), Array('橄榄球兔骑宠', 80011190, 10000), Array('金鱼出租车骑宠(15天)', 80011193, 10000), Array('金龙鱼骑宠(90天)', 80011194, 10000), Array('金鱼出租车骑宠', 80011199, 10000), Array('金龙鱼骑宠', 80011200, 10000), Array('菇菇有点肿骑宠', 80011204, 10000), Array('盖奥勒克骑宠', 80011205, 10000), Array('粉碎机骑宠', 80011206, 10000), Array('厨神的快餐车', 80011234, 10000), Array('变身云朵骑宠', 80011236, 10000), Array('呆萌鲸鱼骑宠', 80011237, 10000), Array('永久性疯人院轮椅坐骑', 80011256, 10000), Array('1人用高级古典车', 80011262, 10000), Array('天狗骑宠', 80011263, 10000), Array('品克缤高级复古车  ', 80011270, 10000));
var head = '#fUI/UIWindow2.img/Quest/quest_info/summary_icon/summary#\r\n';
function start() {
    a = -1;
    action(1, 0, 0);
}
function action(g, f, e) {
    if (g == 0 && a == 0) {
        cm.dispose();
    } else {
        if (g == 1) {
            a++;
        } else {
            a--;
        }
        if (a == 0) {
            text = head + '亲爱的 #e#b' + cm.getPlayer().getName() + '#n#k！欢迎光临#r#e新手装备#n#k商店 #e#d：#n#k\r\n#b#fn方正粗黑宋简体#';
            for (var b = 0; b < itemlist.length; b++) {
                text += '#L' + b + '##s' + itemlist[b][1] + '##q' + itemlist[b][1] + '#  价格' + itemlist[b][2] + '#l\r\n';
                if (b != 0 && (b + 1) % 100 == 0) {
                    text += '\r\n';
                }
            }
            cm.askMenu(text);
        } else {
            if (a == 1) {
                selects = e;
                cm.askAcceptDecline('看看这是你需要购买的装备吗？\r\n\r\n #e#r-#n#k   #s' + itemlist[selects][1] + '# #r#q' + itemlist[selects][1] + '##k\r\n\r\n #e#r-#n#k   你将使用掉 #e#r' + itemlist[selects][2] + '#n#k 金币。');
            } else {
                if (a == 2) {
                    if (cm.getPlayer().getCSPoints(1) >= itemlist[selects][2]) {
                        var d = cm.getItemInfo();
                        var c = itemlist[selects][1];
                        cm.getPlayer().modifyCSPoints(1, -itemlist[selects][2]);
                        cm.teachSkill(itemlist[selects][1], 1, 1);
                        cm.effect_NormalSpeechBalloon('获得骑宠技能' + itemlist[selects][0] + ' ', 1, 0, 0, 3000, 0, 0);
                        cm.playerMessage(-1, ' 获得骑宠技能：  ' + itemlist[selects][0] + ' ');
                        cm.dispose();
                    } else {
                        cm.sendOk('你好像没有足够的点卷~!等你有了再来~!喵~!!');
                        cm.dispose();
                    }
                }
            }
        }
    }
}
var status = -1;